app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "People"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]
---
  def index
    if params[:category].blank?
    @articles = Article.all
    else
      @category_id = Category.find_by(name: params[:category]).id
      @articles = Article.where(category_id: @category_id)

INSERT INTO "articles" ("title", "body", "image_url", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "body" = ?, "image_url" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def update
    respond_to do |format|
      if @article.update(article_params)